import React, { useEffect, useRef } from 'react'
import './footer.css'

export default function Footer() {
	let nav = useRef();

	useEffect(() => {
		if (window.innerWidth < 768 && nav.current) {
			let linkLvl1Arr = nav.current.querySelectorAll('.nav__link_lvl1')
			linkLvl1Arr.forEach(link => {
				let item = link.closest('.nav__item_lvl1')
				let body = item.querySelector('.nav__submenu')
				if (!item.closest('.nav__item_open')) {
					body.style.maxHeight = 0
				}
				item.addEventListener('click', (e) => {
					if (!link.closest('.nav__item_open')) {
						e.preventDefault()
					}

					if (!e.target.closest('.nav__submenu')) {
						if (!item.closest('.nav__item_open')) {
							item.classList.add('nav__item_open')
							body.style.maxHeight = body.scrollHeight + 'px'
						} else {
							item.classList.remove('nav__item_open')
							body.style.maxHeight = 0
						}
					}
				})
			})
		}
	})


	return (
		<footer className='footer'>
			<div className="container">
				<div className="footer__top">
					<div className="footer__logo">
						<img src="/img/logo.svg" alt="img" />
					</div>
					<a href='/' className="footer__btn btn btn_border">
						Подключить сообщество
					</a>
				</div>
				<div className="footer__wrapper">
					<div className="footer__body">
						<div className="footer__title text-20">О Компании</div>
						<div className="footer__desc text-16">
							VK AdBlogger — платформа для сотрудничества авторов и рекламодателей, на которой можно продавать рекламу в сообществах ВКонтакте.
						</div>
					</div>
					<nav className="footer__nav nav" ref={nav}>
						<ul className='nav__list'>
							<li className='nav__item nav__item_lvl1'>
								<a href="/" className='nav__link nav__link_lvl1 text-20'>Кейсы</a>
								<div className="nav__caret"></div>
								<ul className='nav__submenu text-16'>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Отдых по авторски</a>
									</li>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Просмотры растут</a>
									</li>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Розыгрыш автомобиля Тинькофф</a>
									</li>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Все кейсы</a>
									</li>
								</ul>
							</li>
							<li className='nav__item nav__item_lvl1'>
								<a href="/" className='nav__link nav__link_lvl1 text-20'>Документы</a>
								<div className="nav__caret"></div>

								<ul className='nav__submenu text-16'>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Руководство</a>
									</li>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Лицензионное сошглашение</a>
									</li>
								</ul>
							</li>
							<li className='nav__item nav__item_lvl1'>
								<a href="/" className='nav__link nav__link_lvl1 text-20'>Помощь</a>
								<div className="nav__caret"></div>

								<ul className='nav__submenu text-16'>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>FAQ</a>
									</li>
									<li className='nav__item nav__item_lvl2'>
										<a href="/" className='nav__link nav__link_lvl2'>Обратная связь</a>
									</li>
								</ul>
							</li>
						</ul>
					</nav>
				</div>

				<div className="footer__bottom text-16">
					<div className="footer__bottom-row">
						<div className="footer__bottom-item">
							<svg width="106" height="24" viewBox="0 0 106 24" fill="none" xmlns="http://www.w3.org/2000/svg">
								<path d="M38.8208 8.11833C39.766 8.11833 40.6124 8.32994 41.3601 8.75316C42.1078 9.17637 42.6932 9.76887 43.1164 10.5307C43.5397 11.2925 43.7513 12.16 43.7513 13.1334C43.7513 14.1068 43.5114 14.9815 43.0318 15.7574C42.5663 16.5333 41.9173 17.1399 41.085 17.5772C40.2527 18.0004 39.3075 18.212 38.2495 18.212C37.3466 18.212 36.5284 18.0498 35.7948 17.7253C35.0612 17.3868 34.4405 16.893 33.9327 16.2441C33.0721 15.1155 32.6418 13.5567 32.6418 11.5675C32.6418 9.38092 33.1215 7.64574 34.0808 6.36198C35.0542 5.07823 36.6695 4.3376 38.9266 4.1401C39.4204 4.09778 39.7942 4.02724 40.0481 3.92849C40.3162 3.82974 40.5066 3.69572 40.6195 3.52644C40.7323 3.34304 40.817 3.08911 40.8734 2.76465L43.0106 2.9551C42.9542 3.81563 42.7426 4.48573 42.3758 4.96537C42.0231 5.43091 41.5646 5.76243 41.0004 5.95993C40.4361 6.15743 39.7519 6.29145 38.9478 6.36198C38.0026 6.44663 37.262 6.63707 36.7259 6.93333C36.1898 7.21547 35.8089 7.60342 35.5832 8.09717C35.3575 8.59092 35.2094 9.2328 35.1388 10.0228C35.562 9.38798 36.0699 8.91539 36.6624 8.60503C37.269 8.28056 37.9885 8.11833 38.8208 8.11833ZM38.2706 16.0325C39.1594 16.0325 39.8788 15.7715 40.429 15.2495C40.9933 14.7134 41.2755 14.0151 41.2755 13.1546C41.2755 12.3082 40.9933 11.624 40.429 11.102C39.8788 10.5659 39.1594 10.2979 38.2706 10.2979C37.3678 10.2979 36.6342 10.5659 36.0699 11.102C35.5197 11.624 35.2446 12.3082 35.2446 13.1546C35.2446 14.0151 35.5197 14.7134 36.0699 15.2495C36.6342 15.7715 37.3678 16.0325 38.2706 16.0325Z" fill="white" />
								<path d="M49.205 18.0004H45.7558V6.99681H48.0834V15.1649H48.422L52.5272 6.99681H55.9764V18.0004H53.6487V9.83236H53.3102L49.205 18.0004Z" fill="white" />
								<path d="M64.9969 12.3928C65.6035 12.5762 66.1043 12.8936 66.4993 13.345C66.9084 13.7824 67.1129 14.3255 67.1129 14.9744C67.1129 15.581 66.9225 16.1312 66.5416 16.625C66.1748 17.1046 65.6387 17.4926 64.9334 17.7888C64.2421 18.071 63.4451 18.212 62.5422 18.212C61.3431 18.212 60.3133 17.9299 59.4527 17.3656C58.6063 16.8013 58.0491 16.0536 57.781 15.1226L60.0241 14.7417C60.2639 15.2354 60.5813 15.5951 60.9763 15.8209C61.3713 16.0325 61.8862 16.1383 62.5211 16.1383C63.2123 16.1383 63.7413 16.0184 64.1081 15.7785C64.489 15.5387 64.6795 15.2072 64.6795 14.784C64.6795 13.9517 63.96 13.5355 62.5211 13.5355H61.1456V11.4194H62.5211C63.17 11.4194 63.6637 11.3136 64.0023 11.102C64.3409 10.8763 64.5102 10.573 64.5102 10.1921C64.5102 9.78298 64.3338 9.45851 63.9812 9.21869C63.6285 8.97887 63.1912 8.85896 62.6692 8.85896C62.1472 8.85896 61.6746 8.98592 61.2514 9.23985C60.8423 9.49378 60.5249 9.83941 60.2992 10.2767L58.0561 9.89584C58.3806 8.88012 58.959 8.11128 59.7913 7.58931C60.6377 7.05324 61.6252 6.7852 62.7538 6.7852C63.5579 6.7852 64.2774 6.91922 64.9122 7.18726C65.5471 7.45529 66.0408 7.82913 66.3935 8.30878C66.7603 8.78842 66.9437 9.33155 66.9437 9.93816C66.9437 10.5448 66.7603 11.0667 66.3935 11.5041C66.0408 11.9414 65.5753 12.2376 64.9969 12.3928Z" fill="white" />
								<path d="M76.8016 11.3348V6.99681H79.2351V18.0004H76.8016V13.5567H71.8712V18.0004H69.4377V6.99681H71.8712V11.3348H76.8016Z" fill="white" />
								<path d="M92.7732 12.3717C92.7732 12.5833 92.7591 12.8442 92.7309 13.1546H83.8857C83.9986 14.0151 84.3512 14.7064 84.9437 15.2284C85.5362 15.7362 86.291 15.9901 87.2079 15.9901C87.8287 15.9901 88.3859 15.8702 88.8796 15.6304C89.3875 15.3906 89.7754 15.0661 90.0435 14.657L92.3289 15.0379C91.9339 16.0536 91.2497 16.8366 90.2763 17.3868C89.317 17.9369 88.2448 18.212 87.0598 18.212C85.9595 18.212 84.972 17.9722 84.0973 17.4926C83.2368 16.9988 82.5596 16.3217 82.0659 15.4611C81.5862 14.5865 81.3464 13.599 81.3464 12.4986C81.3464 11.3983 81.5862 10.4178 82.0659 9.55727C82.5596 8.68262 83.2368 8.00547 84.0973 7.52583C84.972 7.03208 85.9595 6.7852 87.0598 6.7852C88.1602 6.7852 89.1406 7.03208 90.0012 7.52583C90.8758 8.00547 91.553 8.67557 92.0326 9.5361C92.5264 10.3825 92.7732 11.3277 92.7732 12.3717ZM87.0598 8.90128C86.3262 8.90128 85.6844 9.11289 85.1342 9.5361C84.5981 9.95932 84.2313 10.5307 84.0338 11.2501H90.1281C89.9165 10.5448 89.5356 9.98048 88.9854 9.55727C88.4494 9.11994 87.8075 8.90128 87.0598 8.90128Z" fill="white" />
								<path d="M99.7692 18.212C98.6688 18.212 97.6813 17.9722 96.8067 17.4926C95.932 16.9988 95.2478 16.3217 94.7541 15.4611C94.2744 14.5865 94.0346 13.599 94.0346 12.4986C94.0346 11.3983 94.2744 10.4178 94.7541 9.55727C95.2478 8.68262 95.932 8.00547 96.8067 7.52583C97.6813 7.03208 98.6688 6.7852 99.7692 6.7852C100.982 6.7852 102.055 7.0885 102.986 7.69511C103.931 8.28762 104.601 9.13405 104.996 10.2344L102.711 10.6153C102.471 10.1357 102.097 9.74771 101.589 9.45146C101.095 9.15521 100.538 9.00708 99.9173 9.00708C98.9298 9.00708 98.1257 9.33155 97.505 9.98048C96.8843 10.6294 96.5739 11.4688 96.5739 12.4986C96.5739 13.5284 96.8843 14.3678 97.505 15.0168C98.1257 15.6657 98.9298 15.9901 99.9173 15.9901C100.566 15.9901 101.145 15.842 101.653 15.5458C102.16 15.2354 102.541 14.8334 102.795 14.3396L105.081 14.7205C104.686 15.835 104.001 16.6955 103.028 17.3021C102.055 17.9087 100.968 18.212 99.7692 18.212Z" fill="white" />
								<path fillRule="evenodd" clipRule="evenodd" d="M1.68706 1.68706C0 3.37413 0 6.08942 0 11.52V12.48C0 17.9106 0 20.6259 1.68706 22.3129C3.37413 24 6.08942 24 11.52 24H12.48C17.9106 24 20.6259 24 22.3129 22.3129C24 20.6259 24 17.9106 24 12.48V11.52C24 6.08942 24 3.37413 22.3129 1.68706C20.6259 0 17.9106 0 12.48 0H11.52C6.08942 0 3.37413 0 1.68706 1.68706ZM4.05004 7.30005C4.18004 13.54 7.30001 17.29 12.77 17.29H13.0801V13.72C15.0901 13.92 16.61 15.39 17.22 17.29H20.06C19.28 14.45 17.2299 12.88 15.9499 12.28C17.2299 11.54 19.0299 9.74005 19.4599 7.30005H16.8799C16.3199 9.28005 14.6601 11.08 13.0801 11.25V7.30005H10.5V14.22C8.89999 13.82 6.88003 11.88 6.79003 7.30005H4.05004Z" fill="white" />
							</svg>
						</div>
						<div className="footer__bottom-item">
							Наше сообщество во ВКонтакте
							<svg xmlns="http://www.w3.org/2000/svg" width="22" height="22" viewBox="0 0 22 22" fill="none">
								<path fillRule="evenodd" clipRule="evenodd" d="M1.54648 1.54648C0 3.09295 0 5.58197 0 10.56V11.44C0 16.418 0 18.907 1.54648 20.4535C3.09295 22 5.58197 22 10.56 22H11.44C16.418 22 18.907 22 20.4535 20.4535C22 18.907 22 16.418 22 11.44V10.56C22 5.58197 22 3.09295 20.4535 1.54648C18.907 0 16.418 0 11.44 0H10.56C5.58197 0 3.09295 0 1.54648 1.54648ZM3.71245 6.69082C3.83161 12.4108 6.69159 15.8483 11.7058 15.8483H11.99V12.5758C13.8325 12.7591 15.2257 14.1066 15.7849 15.8483H18.3883C17.6733 13.245 15.794 11.8058 14.6207 11.2558C15.794 10.5775 17.444 8.92748 17.8382 6.69082H15.4731C14.9598 8.50582 13.4383 10.1558 11.99 10.3116V6.69082H9.6249V13.0341C8.15824 12.6675 6.3066 10.8891 6.2241 6.69082H3.71245Z" fill="white" />
							</svg>
						</div>
					</div>
					<div className="footer__bottom-row">
						<div className="footer__bottom-links ">
							<span>© VK, 2024 г.  Все права защищены.</span>
							<a href='/'>Политика конфиденциальности</a>
						</div>
						<div className="footer__bottom-links">
							<span>125167, г. Москва, Ленинградский проспект, д. 39, стр. 79</span>
						</div>
					</div>
				</div>
			</div>
		</footer>
	)
}
